### Data Science

Data analytics: Pandas

Series Methods

In [4]:
import pandas as pd
from pandas import Series

cars1 = Series({'Malibu':36000, 'Camaro':41000, 'Lacetti':12000, 'Cobalt':15000, 'BMW':80000, 'Supra':60000})

cars2 = Series(cars1, index = ['BMW', 'Supra', 'Camaro', 'Malibu', 'Cobalt', 'Lacetti', 'Audi', 'Lamba'])

print(cars1)
print("------------------")
print(cars2)

Malibu     36000
Camaro     41000
Lacetti    12000
Cobalt     15000
BMW        80000
Supra      60000
dtype: int64
------------------
BMW        80000.0
Supra      60000.0
Camaro     41000.0
Malibu     36000.0
Cobalt     15000.0
Lacetti    12000.0
Audi           NaN
Lamba          NaN
dtype: float64

`isnull()`  returns True if NaN

In [5]:
cars2.isnull()

BMW        False
Supra      False
Camaro     False
Malibu     False
Cobalt     False
Lacetti    False
Audi        True
Lamba       True
dtype: bool

`notnull()`  returns False if NaN

In [6]:
cars2.notnull()

BMW         True
Supra       True
Camaro      True
Malibu      True
Cobalt      True
Lacetti     True
Audi       False
Lamba      False
dtype: bool

In [7]:
print(cars1 + cars2) # calculates values of the appropriate indexes

Audi            NaN
BMW        160000.0
Camaro      82000.0
Cobalt      30000.0
Lacetti     24000.0
Lamba           NaN
Malibu      72000.0
Supra      120000.0
dtype: float64

`name` `index.name`

In [13]:
cars1.name = "Shevrolet"
cars1.index.name = "Price:"

In [12]:
cars2.name = "Shevrolet"
cars2.index.name = "Price:"

In [18]:
print(f"{cars1}\n-----------------------------\n{cars2}")

Price:
Malibu     36000
Camaro     41000
Lacetti    12000
Cobalt     15000
BMW        80000
Supra      60000
Name: Shevrolet, dtype: int64
-----------------------------
Price:
BMW        80000.0
Supra      60000.0
Camaro     41000.0
Malibu     36000.0
Cobalt     15000.0
Lacetti    12000.0
Audi           NaN
Lamba          NaN
Name: Shevrolet, dtype: float64